{
  "early": "- Henry Miller was born: Henry Valentine Miller was born on December 26 in New York City. (1891, New York City)\n- Family moved to Brooklyn: Miller's family moved to 1063 Decatur Street in Brooklyn's Bushwick neighborhood. (1900, Brooklyn, New York City)\n- Henry Miller was active with the Socialist Party of America: Miller was active with the Socialist Party of America. (1900 circa, New York)\n- Attended Eastern District High School: Miller attended Eastern District High School in Williamsburg, Brooklyn, after finishing elementary school. (early 1900s, Williamsburg, Brooklyn)\n- Attended City College of New York: Miller attended the City College of New York for one semester. (early 1910s, New York City)\n- Henry Miller married Beatrice Sylvas Wickens: Miller married Beatrice Sylvas Wickens, an amateur pianist. (1917, New York)\n- Daughter Barbara born: Miller and Beatrice had a daughter named Barbara. (1919, New York)\n- Worked at Western Union: Miller worked at Western Union as personnel manager in the messenger department. (1920-1924, New York City)\n- Wrote first novel Clipped Wings: Miller wrote his first novel, 'Clipped Wings,' during a three-week vacation in March (unpublished, only fragments remain). (1922 March, New York City)\n- Divorced Beatrice Sylvas Wickens: Miller was divorced from Beatrice Sylvas Wickens. (1923 December 21, New York)\n- Met June Mansfield: Miller met and became enamored of June Mansfield (born Juliet Edith Smerth) at a dance hall. (1923, New York)\n- Married June Mansfield: Miller married June Mansfield. (1924 June 1, New York)\n- Quit Western Union to write: Miller quit his job at Western Union to dedicate himself completely to writing. (1924, New York)",
  "personal": "- Spent months in Paris with June: Miller spent several months in Paris with June, trip financed by Roland Freedman. (1928, Paris, France)\n- Moved to Paris alone: Miller moved to Paris unaccompanied. (1930, Paris, France)\n- Divorced by June in Mexico: June divorced Miller by proxy. (1934, Mexico City, Mexico)\n- Visited Greece: Miller visited Greece, invited by Lawrence Durrell who was living in Corfu. (1939, Greece)\n- Returned to New York: Miller returned to New York. (1940, New York City)\n- Moved to California: Miller moved to California in June, initially residing just outside Hollywood in Beverly Glen. (1942 June, California)\n- Settled in Big Sur: Miller settled in Big Sur. (1944, Big Sur, California)\n- Married Janina Martha Lepska: Miller married Janina Martha Lepska. (1944, United States)\n- Lived in Big Sur with bohemian writers: Miller continued living in Big Sur with other bohemian writers. (from 1947, Big Sur, California)\n- Divorced Janina Martha Lepska: Miller was divorced from Janina Martha Lepska. (1952, United States)\n- Married artist Eve McClure: Miller married artist Eve McClure. (1953, United States)\n- Divorced Eve McClure: Miller was divorced from Eve McClure. (1960, United States)\n- Reunion with June in New York: Miller arranged a reunion with ex-wife June in New York. (1961, New York)\n- Moved to Pacific Palisades: Miller moved to 444 Ocampo Drive, Pacific Palisades, Los Angeles. (1963, Pacific Palisades, Los Angeles, California)\n- Married Hiroko Tokuda: Miller married Hiroko Tokuda. (1967, United States)\n- Divorced Hiroko Tokuda: Miller was divorced from Hiroko Tokuda. (1977, United States)\n- Henry Miller died: Henry Miller died of circulatory complications at home. (1980 June 7, Pacific Palisades, Los Angeles)",
  "career": "- Wrote Moloch: Miller wrote 'Moloch: or, This Gentile World,' initially under the guise of a novel by June Mansfield (unpublished until 1992). (1927-1928, New York)\n- Proofreader for Chicago Tribune Paris: Miller was employed by the Chicago Tribune Paris edition as a proofreader. (1931, Paris, France)\n- Published Tropic of Cancer: Miller's first published book, 'Tropic of Cancer,' was published by Obelisk Press (banned in the United States). (1934, Paris, France)\n- Published Black Spring: Miller published 'Black Spring' (banned in the United States). (1936, Paris, France)\n- Published Tropic of Capricorn: Miller published 'Tropic of Capricorn' (banned in the United States). (1939, Paris, France)\n- Published The Colossus of Maroussi: Miller described his visit to Greece in 'The Colossus of Maroussi'. (1941, United States)\n- Began writing Sexus: Miller began writing 'Sexus,' the first novel in 'The Rosy Crucifixion' trilogy. (1942, California)\n- Published Sunday After the War: Miller published 'Sunday After the War'. (1944, United States)\n- Published The Air-Conditioned Nightmare: Miller published 'The Air-Conditioned Nightmare'. (1945, United States)\n- Published Big Sur and the Oranges of Hieronymus Bosch: Miller published 'Big Sur and the Oranges of Hieronymus Bosch'. (1957, United States)\n- Completed The Rosy Crucifixion trilogy: Miller completed 'The Rosy Crucifixion' trilogy (initially banned in the U.S., published in France and Japan). (1959, United States)\n- Tropic of Cancer published in the US: 'Tropic of Cancer' was published in the United States by Grove Press, leading to obscenity trials. (1961, United States)\n- Published On Turning Eighty: Miller published 'On Turning Eighty,' a chapbook with 200 copies. (1972, United States)\n- Nominated for Nobel Prize: Miller was nominated for the Nobel Prize in Literature by University of Copenhagen professor Allan Philip. (1973, )",
  "legacy": "- Published The Colossus of Maroussi: Miller described his visit to Greece in 'The Colossus of Maroussi'. (1941, United States)\n- Published Big Sur and the Oranges of Hieronymus Bosch: Miller published 'Big Sur and the Oranges of Hieronymus Bosch'. (1957, United States)\n- Tropic of Cancer published in the US: 'Tropic of Cancer' was published in the United States by Grove Press, leading to obscenity trials. (1961, United States)\n- Nominated for Nobel Prize: Miller was nominated for the Nobel Prize in Literature by University of Copenhagen professor Allan Philip. (1973, )\n- Henry Miller died: Henry Miller died of circulatory complications at home. (1980 June 7, Pacific Palisades, Los Angeles)"
}
