{
  "existing_events": {
    "early": "- Henry Miller was born: Henry Valentine Miller was born on December 26 in New York City. (1891, New York City)\n- Attended Eastern District High School: Miller attended Eastern District High School in Williamsburg, Brooklyn, after finishing elementary school. (early 1900s, Williamsburg, Brooklyn)",
    "personal": "- Met June Mansfield: Miller met and became enamored of June Mansfield (born Juliet Edith Smerth) at a dance hall. (1923, New York)\n- Henry Miller died: Henry Miller died of circulatory complications at home. (1980 June 7, Pacific Palisades, Los Angeles)",
    "career": "- Published Tropic of Cancer: Miller's first published book, 'Tropic of Cancer,' was published by Obelisk Press (banned in the United States). (1934, Paris, France)\n- Tropic of Cancer published in the US: 'Tropic of Cancer' was published in the United States by Grove Press, leading to obscenity trials. (1961, United States)",
    "legacy": "- Nominated for Nobel Prize: Miller was nominated for the Nobel Prize in Literature by University of Copenhagen professor Allan Philip. (1973, )\n- Henry Miller died: Henry Miller died of circulatory complications at home. (1980 June 7, Pacific Palisades, Los Angeles)"
  },
  "new_events": "- Met Robert W. Service in Paris: Miller met author Robert W. Service on a Paris street and discussed books, with Service recalling the encounter in his autobiography. (1928, Paris)\n- Financial support from Anaïs Nin: Anaïs Nin, with Hugh Guiler, financed Miller's living expenses through the 1930s, including rent for an apartment at 18 Villa Seurat, and funded the first printing of Tropic of Cancer in 1934. (1930s, Paris)\n- Learned about and promoted George Dibbern: During the late 1930s, Miller learned about German-born sailor George Dibbern, helped promote his memoir Quest, and organized charity to help him. (late 1930s, France)\n- Wrote The Smile at the Foot of the Ladder: In 1948, Miller wrote a novella he called his 'most singular story,' The Smile at the Foot of the Ladder. (1948, California)"
}
